In [117]:
import pandas as pd

In [118]:
items = {'Bob': pd.Series([245, 25, 55], index=['bike', 'pants', 'watch']), 
         'Alice': pd.Series([40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])}

type(items)

dict

In [119]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [120]:
# Creating the same DataFrame without index labels
data = {'Bob': pd.Series([245, 25, 55]),
        'Alice': pd.Series([40, 110, 500, 45])}

df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [121]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [122]:
shopping_carts.shape

(5, 2)

In [123]:
shopping_carts.ndim

2

In [124]:
shopping_carts.size

10

**Creating a DataFrame from arbitrary selected dictionary data**

In [125]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [126]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [127]:
alice_sel_shopping_cart = pd.DataFrame(items, index= ['glasses', 'bike'], columns= ['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

**Creating DataFrames from dictionaries of arrays or lists **

In [128]:
data = {'Integer': [1, 2, 3],
        'Floats':[4.5, 8.2, 9.6]}

df = pd.DataFrame(data, index= ['label 1', 'label 2', 'label 3'])
df

         Integer  Floats
label 1        1     4.5
label 2        2     8.2
label 3        3     9.6

In [129]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

**Accesing elements**

In [130]:
store_items[['bikes']] # by label

         bikes
store 1     20
store 2     15

In [131]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [132]:
store_items.loc[['store 1']] # Access a row

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [133]:
store_items['bikes']['store 2'] # column first and the row, otherwise an error occur

15

**Adding new elements**

In [134]:
store_items['shirts'] = [15, 2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [135]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [136]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses':4}]

new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [137]:
store_items = store_items.append(new_store, sort=True)
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [138]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new_watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [139]:
store_items.insert(5, 'shoes', [8, 5, 0]) # Insers new column shoes at a specific location
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      NaN     30    15.0   45.0      8       35          NaN
store 2     15     50.0      5     2.0    7.0      5       10         10.0
store 3     20      4.0     30     NaN    NaN      0       35         35.0

**Deleting columns and/or rows**

In [140]:
store_items.pop('new_watches')
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches
store 1     20      NaN     30    15.0   45.0      8       35
store 2     15     50.0      5     2.0    7.0      5       10
store 3     20      4.0     30     NaN    NaN      0       35

In [141]:
# Remember that drop does not remove elements unless reasigned like below
store_items = store_items.drop(['watches', 'shoes'], axis= 1) 
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [142]:
store_items = store_items.drop(['store 1', 'store 2'], axis= 0)
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

**Renaming labels of rows and columns**

In [145]:
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [144]:
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [146]:
store_items = store_items.set_index('pants') # using values in pants as index values
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN